/* 
https://cryptozombies.io/th/lesson/2/chapter/1
หัวข้อ 1: ภาพรวมของบทที่ 2
ในบทที่ 1 เราได้สร้างฟังก์ชันที่สามารถรับข้อมูลในส่วนของชื่อ ซึ่งจะถูกนำไปใช้ในการสร้างซอมบี้ขึ้นมาในรูปแบบของการสุ่ม และเพิ่มซอมบี้ตัวนั้นเข้าไปใน database ที่อยู่ภายในแอพพลิเคชั่นซอมบี้ของเราบน blockchain

ในบทที่ 2 เราจะทำให้แอพพลิเคชั่นนี้มีความคล้ายเกมมากขึ้น: เราจะทำให้เกมนี้สามารถเล่นได้พร้อมกันหลายๆ คน (multi-player) และเรายังจะเพิ่มลูกเล่นในการสร้างซอมบี้ให้มากขึ้นไปอีก โดยจะไม่สร้างจากเพียงแค่การสุ่มเท่านั้น

สงสัยใช่ไหมว่าจะสร้างซอมบี้ตัวใหม่ขึ้นมาอย่างไร? โดยการให้มัน "กิน" สิ่งมีชีวิตอื่นยังไงล่ะ!

DNA ของ NoName
6038148195197117

DNA ของ มนุษย์
8012756276883397

DNA จาก เจ้าซอมบี้กลายพันธุ์ ใหม่
7025452236040299


*/
