/* 
Function Declarations การประกาศค่าฟังก์ชั่น

การประกาศฟังก์ชั่นใน Solidity จะมีหน้าตาดังนี้

function eatHamburgers(string _name, uint _amount) {

}

โดยตัวอย่างดังกล่าวจะเป็นฟังก์ชั่นที่ชื่อว่า eatHamburgers ที่จะรับตัวแปร 2 ค่า ได้แก่ ข้อมูลชนิด string และ uint โดยในตอนนี้ภายในฟังก์ชั่นจะยังไม่มีอะไร

โน้ต: การเริ่มต้นชื่อของตัวแปรต่างๆ ภายในฟังก์ชั่นด้วยเครื่องหมายสัญประกาศ (_)
ใช้เพื่อที่จะแยกความแตกต่างตัวแปรเหล่านี้ออกจากตัวแป global

คุณสามารถเรียกฟังก์ชั่นได้ดังนี้
eatHamburgers("vitalik", 100);

*/