/* 
https://cryptozombies.io/th/lesson/1/chapter/10
More on Functions
เราจะมาพูดถึงฟังก์ชั่น return values และ การเข้าถึงฟังก์ชั่น (function modifiers)
การรีเทิร์นค่าต่างๆ
string greeting = "What's up dog";

function sayHello() public returns (string) {
  return greeting;
}

การเข้าถึงฟังก์ชั่น
ทำให้ในกรณีนี้เราสามารถประกาศค่าของฟังก์ชั่นนี้ให้เป็น view ซึ่งก็หมายถึงฟังก์ชั่นนี้สามารถที่จะดูได้แต่ไม่สามารถเข้าไปปรับเปลี่ยนค่าต่างๆภายในได้:
function sayHello() public view returns (string) {

นอกจากนี้ใน Solidity ยังมีฟังชั่น pure หมายถึงเราไม่สามารถแม้แต่จะเข้าถึงข้อมูลใดๆในแอพพลิเคชั่นนี้ได้ จะมีหน้าตาดังต่อไปนี้:
function _multiply(uint a, uint b) private pure returns (uint) {
  return a * b;
}

ฟังก์ชั่นนี้จะไม่สามารถแม้แต่อ่านค่าจากสถานะของแอพพลิเคชั่นได้ นั่นก็คือมันจะรีเทิร์นค่าก็ต่อเมื่อมีพารามีเตอร์ของฟังก์ชั่นเข้ามาเท่านั้น ทำให้ในกรณีนี้เราจะต้องประกาศค่าของฟังก์ชั่นเป็น pure

โน้ต : เราอาจจะจำไม่ได้ว่าเมื่อไหร่ถึงจะต้องใส่ค่าของฟังก์ชั่นเป็น pure/view แต่โชคดีที่คอมไพล์เลอร์ของSolidity นั้นสามารถแจ้งเตือนคุณได้เสมอว่า modifier ชนิดใดที่คุณควรจะใช้ สำหรับฟังก์ชั่นที่ได้สร้างขึ้นมา
*/