/* 
https://cryptozombies.io/th/lesson/1/chapter/9
Private / Public Functions
ใน Solidity นั้น ค่าเริ่มต้นของฟังก์ชั่นจะเป็นรูปแบบสาธารณะ หรือ public ซึ่งแปลว่าใครก็ตาม (หรือสัญญาอื่นๆ) จะสามารถเรียกฟังก์ชั่นใน contract ของคุณได้และยังสามารถเรียกใช้โค้ดได้อีกด้วย

การประกาศค่าฟังก์ชั่นเป็น private
uint[] numbers;

function _addToArray(uint _number) private {
  numbers.push(_number);
}
ซึ่งแปลว่ามีแค่ฟังก์ชั่นอื่นๆ ภายใน contract ของเราเท่านั้นที่จะสามารถเรียกใช้ฟังก์ชั่นนี้ได้ และเพิ่มเข้าไปใน array ที่ชื่อว่า numbers

จะเห็นได้ว่าเราสามารถใช้คีย์เวิร์ด private วางไว้ด้านหลังของชื่อฟังก์ชั่น เหมือนกับพารามิเตอร์ต่างๆ จะสะดวกขึ้นหากเริ่มต้นชื่อฟังก์ชั่นที่เป็นชนิด private ด้วยเครื่องหมายสัญประกาศ (_ หรือ underscore นั่นเอง)



*/